/*============================================================
*	@file	 : observer.h
*	@brief	 : オブザーバー
*
* 　@author  : @akitsuki-35（https://github.com/akitsuki-35）
* 　@date	 : 2026/05/25
*	@updated : 2026/06/02
*============================================================*/
#ifndef OBSERVER_H
#define OBSERVER_H

/*------------------------------------------------------------
	前方宣言
------------------------------------------------------------*/
class LayerObjectState;

/*============================================================
*	@class	: Observer
*	@brief	: Subjectからの通知受信
*============================================================*/
class Observer
{
public:
	virtual void OnNotify() = 0;
};

#endif // OBSERVER_H